const questions = [
    {
        id: 1,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Площадь квадрата равна произведению двух его смежных сторон.",
                correct: true
            },
            {
                text: "Диагональ трапеции делит её на два равных треугольника.",
                correct: false
            },
            {
                text: "Если две стороны одного треугольника соответственно равны двум сторонам другого треугольника, то такие треугольники равны.",
                correct: false
            }
        ]
    },

    {
        id: 2,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Если стороны одного четырёхугольника соответственно равны сторонам другого четырёхугольника, то такие четырёхугольники равны.",
                correct: false
            },
            {
                text: "Через любую точку, лежащую вне окружности, можно провести две касательные к этой окружности.",
                correct: true
            },
            {
                text: "Все углы ромба равны.",
                correct: false
            }
        ]
    },

    {
        id: 3,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Площадь квадрата равна произведению двух его смежных сторон.",
                correct: true
            },
            {
                text: "Всегда один из двух смежных углов острый, а другой тупой.",
                correct: false
            },
            {
                text: "Все хорды одной окружности равны между собой.",
                correct: false
            }
        ]
    }
]

const questions_answer = [
    {
        id: 100,
        type: '2',
        question: "У бабушки 20 чашек: 10 с красными цветами, остальные с синими. Бабушка наливает чай в случайно выбранную чашку. Найдите вероятность того, что это будет чашка с синими цветами.",
        answer: "0,5"
    },

    {
        id: 101,
        type: '2',
        question: "В среднем из 80 карманных фонариков, поступивших в продажу, двенадцать неисправных. Найдите вероятность того, что выбранный наудачу в магазине фонарик окажется исправен.",
        answer: "0,9"
    },

    {
        id: 102,
        type: '2',
        question: "В фирме такси в данный момент свободно 10 машин: 5 чёрных, 1 жёлтая и 4 зелёных. По вызову выехала одна из машин, случайно оказавшаяся ближе всего к заказчику. Найдите вероятность того, что к нему приедет жёлтое такси.",
        answer: "0,1"
    }
]