const questions = [
    {
        id: 1,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Площадь квадрата равна произведению двух его смежных сторон.",
                correct: true
            },
            {
                text: "Диагональ трапеции делит её на два равных треугольника.",
                correct: false
            },
            {
                text: "Если две стороны одного треугольника соответственно равны двум сторонам другого треугольника, то такие треугольники равны.",
                correct: false
            }
        ]
    },

    {
        id: 2,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Если стороны одного четырёхугольника соответственно равны сторонам другого четырёхугольника, то такие четырёхугольники равны.",
                correct: false
            },
            {
                text: "Через любую точку, лежащую вне окружности, можно провести две касательные к этой окружности.",
                correct: true
            },
            {
                text: "Все углы ромба равны.",
                correct: false
            }
        ]
    },

    {
        id: 3,
        type: '1',
        question: "Какое из следующих утверждений является истинным высказыванием?",
        answers: [
            {
                text: "Площадь квадрата равна произведению двух его смежных сторон.",
                correct: true
            },
            {
                text: "Всегда один из двух смежных углов острый, а другой тупой.",
                correct: false
            },
            {
                text: "Все хорды одной окружности равны между собой.",
                correct: false
            }
        ]
    }
]
